#!/bin/bash

# ========================================
# ブレース展開
# ========================================

# ----------------------------------------
# ブレース展開で1001,1002を指定
# ----------------------------------------
echo file-{1001,1002}.txt
# file-1001.txt  file1002.txt
#
# {}の中にカンマ区切りで文字列を並べて書くと、それぞれが前後の文字列と
# 組み合わせて展開される。

# ----------------------------------------
# ブレース展開で5つのファイル名を生成
# ----------------------------------------
echo file-{1001,1002,old,new,}.txt
# file-1001.txt  file-1002.txt  file-old.txt  file-new.txt  file-.txt
#
# ブレース展開では、{}の中にいくつでも要素を記述できる。
# 要素は空文字列でもいい
# 1001、1002、old、new、(空文字列)の5つの文字列を指定している

# ----------------------------------------
# ブレース展開でディレクトリを新規作成
# ----------------------------------------
mkdir work/project{src,log,test}

# work/project/src  work/project/log  work/project/testと展開されるので
# work/project/ディレクトリの下に3つの新しいディレクトリを作成できる

# ----------------------------------------
# ブレース展開のシーケンス式(数値)
# ----------------------------------------
echo file-{8..11}.txt
# file-8.txt  file-9.txt  file-10.txt  file-11.txt
#
# ブレース展開で{始まり..終わり}とドットを2つ並べて書くと、「始まり」から「終わり」までの連続した数字や文字に展開される。これをシーケンス式と呼ぶ

# ----------------------------------------
# ブレース展開のシーケンス式(文字)
# ----------------------------------------
echo file-{c..f}.txt
# file-c.txt  file-d.txt  file-e.txt  file-f.txt

# ----------------------------------------
# シーケンス式で増分
# ----------------------------------------
echo file-{8..11..2}.txt
# file-8.txt  file-10.txt
