#!/bin/sh

########## = によるシェル変数の設定
# $ echo ${ABC:=xyz}
# ABCという変数がまだ使われていないか、ABC=""と定義している場合に、xyzを代入
# ABC=lmnなど値をすでに入れていたらlmnをそのまま表示

# $ echo ${ABC=xyz}
# ABC=""と定義した場合にも代入しなくなる（コロン(:)を外した場合）

# $ echo ${ABC:=xyz}
# $ xyz
# $ echo $ABC
# $ xyz
# $ echo ${ABC:=abc}
# $ xyz
# $ ABC=""
# $ echo ${ABC=123}
# $
# $ echo ${ABC:=123}
# $ 123

########## - によるシェル変数の設定
# - 記号を使うと、変数がこれまで未使用、未設定の状態のときに値を代入しないまま、指定した値をそのまま返す。

# $ echo ${ABC:-xyz}
# $ xyz
# $ echo $ABC
# $			# 上でxyzが出力されるが、値はセットされていない
# $ echo ${ABC:=abc}
# $ abc
# $ echo $ABC
# $ abc

# - は位置パラメタが使える
# $ echo "The variable ${1:-abc} will be used"
# $1 に何等かの値がセットされていればそれを使い、$1 という値が使用されていないかヌルなら abc という結果を返す。しかし値は代入しない

########## ? によるシェル変数の設定
# ? は、変数がこれまで未使用、未設定かを確認する。未使用、未設定のときに?以降の部分が表示され、シェルスクリプトの場合には、そこで処理が終了する。

# $ echo ${ABC:?"ABC is not set"}

########## + によるシェル変数の設定
# + は変数に何らかの値が設定されているときに、値を取り替えて表示する。元の変数の値は変更しない。つまり、変数の値を変更せずにそのときだけ結果を変える場合に利用する

# $ echo ${ABC:+zzz}
# $			# ABC が未設定なら何もしない
# $ ABC=www
# $ echo $ABC
# $ www
# $ echo ${ABC:+zzz}
# $ zzz
# $ echo $ABC
# $ www
