#!/bin/sh

STRING=test
case "$STRING" in
	abc ) echo "これは abc です" ;;
	def | ghi ) echo "これは def か ghi かのどちらかです" ;;
	abc* ) echo "これは abc で始まる文字列です" ;;
	[Yy]* ) echo "Y か y で始まる文字列 (Yes No の判定に使える)" ;;
	"[Yy]" ) echo "これはY あるいは y に限る" ;;
	"[Yy]*" ) echo "これはY* あるいは y* という文字に限る" ;;
	"[Yy]"* ) echo "Y か y で始まる文字列(3つ上と同じ)" ;;
	[!Nn]* ) echo "N でも n でも始まらない文字列です" ;;
	[a-z][AB] ) echo "小文字で始まり A か B で終わる文字列" ;;
	\* ) echo "これはアスタリスク (*) です" ;;
	"*" ) echo "これもアスタリスク (*) です" ;;
	'*' ) echo "これまたアスタリスク (*) です" ;;
	\? ) echo "これはクエスチョンマーク (?) です" ;;
	? ) echo "なにか 1 文字の文字です" ;;
	"" ) echo "何もない(ヌル文字や変数が未セット)場合" ;;
	'""' ) echo "ダブルクォーテーションが 2 つ並んでいる場合" ;;
	\"\" ) echo "上の意味と同じになります" ;;
	* ) echo "今までの条件に合致しない残り全部" ;;
esac
