#!/bin/bash

# ========================================
# サイズが大きなファイルを一覧で出力する
# ========================================

# ----------------------------------------
# 変数設定
# ----------------------------------------

limit_para=100
target_dir=work
target_file=index.log
result_file=result.log

# ----------------------------------------
# 必要ファイル作成
# ----------------------------------------

touch $result_file

# ----------------------------------------
# 一覧作成
# ----------------------------------------

du -ab $target_dir | gawk '{print $1,$NF}' > $target_file

# ----------------------------------------
# 閾値を超えていないか確認
# ----------------------------------------

cat $target_file | while read line
do
	check_file=`echo $line | gawk '{print $1}'`
	exist_file=`echo $line | gawk '{print $NF}'`
	if [ $check_file -ge $limit_para ]&&[ -f $exist_file ]; then
		echo $exist_file >> $result_file
	fi
done

# ----------------------------------------
# 結果表示
# ----------------------------------------

cat $result_file

# ----------------------------------------
# 後片付け
# ----------------------------------------

rm $target_file
rm $result_file
