#!/bin/bash

# ========================================
# 毎日同じ時間にファイルを共有ディレクトリにバックアップ
# ========================================

# ----------------------------------------
# 変数設定
# ----------------------------------------

target_file=work/test-file
target_dir=work
backup_dir=backup_dir

# ----------------------------------------
# バックアップファイルがあるか確認
# ----------------------------------------

if [ ! -d $backup_dir ]; then
	echo "not exsit backup_dir"
fi

# ----------------------------------------
# 特定のファイルのみをバックアップしたい場合
# ----------------------------------------

if [ -e $target_file ]; then
	rsync $target_file $backup_dir/
fi

# ----------------------------------------
# ディレクトリごとバックアップしたい場合 
# ----------------------------------------

if [ -d $target_dir ]; then
	rsync -r $target_dir $backup_dir/
fi
