#!/bin/bash

# ========================================
# ファイル名とファイルサイズがまったく同じなファイルを見つける
# ========================================

# ----------------------------------------
# 変数設定
# ----------------------------------------

target_file=index.log
result_file=result.log

# ----------------------------------------
# 必要ファイル作成
# ----------------------------------------

touch $result_file

# ----------------------------------------
# 数字のみのファイルを検索し一覧化
# ----------------------------------------

find ./ -regex ".*/[0-9]+$" -type f > $target_file

# ----------------------------------------
# ファイルサイズと照らし合わせて一致するものを洗い出し
# ----------------------------------------

cat $target_file | while read line
do
	check_file=`echo $line | gawk -F/ '{print $NF}'`
	check_size=`du -ab $line | gawk '{print $1}'`
	if [ $check_file -eq $check_size ]; then
		echo $line >> $result_file
	fi
done

# ----------------------------------------
# 結果表示
# ----------------------------------------

cat $result_file

# ----------------------------------------
# 後片付け
# ----------------------------------------

rm $target_file
rm $result_file
