#!/bin/bash

# ========================================
# ファイル名の頭に一律[myfiles]とつけたい
# ========================================

# ----------------------------------------
# 変数設定
# ----------------------------------------

target_dir=work/base/
target_file=index.log
prefix_name=[myfiles]

# ----------------------------------------
# 対象のファイル一覧作成
# ----------------------------------------

find $target_dir -maxdepth 1 -type f | awk -F/ '{print $NF}' > $target_file
# ----------------------------------------
# 対象のファイル一覧に基づいてファイル名に[myfiles]を追加
# ----------------------------------------

cat $target_file | while read line
do
	mv $target_dir$line $target_dir$prefix_name$line
done

# ----------------------------------------
# 後片付け
# ----------------------------------------

rm $target_file
