#!/bin/bash

# ========================================
# 100個のディレクトリを1つずつ圧縮する
# ========================================

# ----------------------------------------
# 変数設定
# ----------------------------------------

target_dir=work/base/
target_file=index.log

# ----------------------------------------
# 対象のディレクトリ一覧作成
# ----------------------------------------

find $target_dir -maxdepth 1 -type d | gawk -F/ '{print $NF}' > $target_file

# ----------------------------------------
# 対象のディレクトリ一覧に基づいてアーカイブ圧縮
# ----------------------------------------

cat $target_file | while read line
do
	tar -czf $line.tar.gz $target_dir$line
done

# ----------------------------------------
# 後片付け
# ----------------------------------------

rm $target_file
