#!/bin/bash

# ========================================
# 1枚の画像から複数の画像を作成する
# ========================================

# ----------------------------------------
# 変数設定
# ----------------------------------------

base_dir=pic/base
resize_dir=pic/resize

# ----------------------------------------
# 環境確認
# ----------------------------------------

convert -version
if [ ! $? -eq 0 ]; then
	echo "環境が整っていません。imagemagickをインストールしてください。"
	exit
fi

if [ ! -d $resize_dir ]; then
	mkdir $resize_dir
fi

# ----------------------------------------
# baseディレクトリ内の画像からいろんなサイズを作成
# ----------------------------------------

# ----------------------------------------
# iPhone 6 iPhone 6s iPhone 7
# ----------------------------------------

convert -geometry 375x667 $base_dir/$1 $resize_dir/375x667_$1

# ----------------------------------------
# iPhone 6 iPhone 6s iPhone 7 (拡大)
# ----------------------------------------

convert -geometry 320x568 $base_dir/$1 $resize_dir/320x568_$1

# ----------------------------------------
# iPhone 6 Plus iPhone 6s Plus iPhone 7 Plus 
# ----------------------------------------

convert -geometry 414x736 $base_dir/$1 $resize_dir/414x736_$1
