#!/bin/bash

# ========================================
# カラー画像をまとめて白黒に変換する
# ========================================

# ----------------------------------------
# 変数設定
# ----------------------------------------

base_dir=pic/base
modify_dir=pic/modiry

# ----------------------------------------
# 環境確認
# ----------------------------------------

convert -version

if [ ! $? -eq 0 ]; then
	echo "環境が整っていません。imagemagickをインストールしてください。"
	exit
fi

if [ ! -d $modify_dir ]; then
	mkdir $modify_dir
fi

# ----------------------------------------
# ディレクトリ内の画像を一括で白黒にする
# ----------------------------------------

for FILE in `ls $base_dir/ | grep -i jpg`
do
	convert -type GrayScale $base_dir/${FILE} $modify_dir/${FILE}
done
