#!/bin/bash

# ========================================
# 画像ファイルが100KBより小さくなるように調整
# ========================================

# ----------------------------------------
# 変数設定
# ----------------------------------------

base_dir=pic/base
modify_dir=pic/modify

# ----------------------------------------
# 環境確認
# ----------------------------------------

convert -version

if [ ! $? -eq 0 ]; then
	echo "環境が整っていません。imagemagickをインストールしてください。"
	exit
fi

if [ ! -d $modify_dir ]; then
	mkdir $modify_dir
fi

# ----------------------------------------
# 現在のファイルサイズを取得し、縮小率を算出
# ----------------------------------------

size=`ls -l $base_dir/$1 | awk '{print 100/int($5/102400)}'`

convert -resize $size% $base_dir/$1 $modify_dir/$1
